[
  {
    "collection_row_id": 1,
    "collection_name": "Pentateuch",
    "collection_description": "The first five books of the Bible, traditionally attributed to Moses, forming the theological and historical foundation of Scripture. They narrate creation, humanity's fall, God's covenant with Israel, the Exodus from Egypt, and the giving of the Law, establishing the identity, mission, and worship of God's people.",
    "collection_order_index": 1,
    "book_count": 5
  },
  {
    "collection_row_id": 2,
    "collection_name": "Historical Books",
    "collection_description": "These books record Israel's history from entering the Promised Land through the monarchy, exile, and return. They reveal God's faithfulness, the consequences of obedience and rebellion, and the unfolding story of God shaping His people through real events and leaders.",
    "collection_order_index": 2,
    "book_count": 12
  },
  {
    "collection_row_id": 3,
    "collection_name": "Poetic and Wisdom Literature",
    "collection_description": "Poetry, songs, and philosophical reflection addressing the complexities of life, suffering, worship, wisdom, and the nature of God. These books provide deeply personal and universal insight into human experience and the pursuit of godliness.",
    "collection_order_index": 3,
    "book_count": 5
  },
  {
    "collection_row_id": 4,
    "collection_name": "Prophetic Books",
    "collection_description": "Messages delivered by God's prophets calling His people to repentance, righteousness, and renewed covenant faithfulness. They warn of judgement for sin, reveal God's heart for justice and mercy, and foretell future hope, including the coming Messiah and ultimate restoration.",
    "collection_order_index": 4,
    "book_count": 17
  },
  {
    "collection_row_id": 5,
    "collection_name": "Gospels & Acts",
    "collection_description": "The Gospels present the life, teachings, death, and resurrection of Jesus Christ, revealing Him as the promised Messiah and Savior. Acts continues the narrative, documenting the birth and expansion of the early church through the power of the Holy Spirit and the mission of the apostles.",
    "collection_order_index": 5,
    "book_count": 5
  },
  {
    "collection_row_id": 6,
    "collection_name": "Epistles",
    "collection_description": "Letters written to early Christian individuals and communities adressing theology, spiritual growth, practical Christian living, correction, encouragement and church leadership. They unpack the meaning of Christ's work and guide believers in following Him.",
    "collection_order_index": 6,
    "book_count": 21
  },
  {
    "collection_row_id": 7,
    "collection_name": "Apocalyptic Literature",
    "collection_description": "A symbolic and visionary prophetic work revealing God's ultimate victory over evil and the fulfillment of His kingdom. Written to strengthen belivers in persecution, it portrays final judgement, Christ's return and the promise of a new heaven and new earth.",
    "collection_order_index": 7,
    "book_count": 1
  }
]